Repository: kareeeeeeem/tripto
Catalog: lib/l10n/app_*.arb
Languages: ar

# privacypolicy34
source: Our application may use cookies or similar technologies to:
ar: قد يستخدم التطبيق تقنيات الكوكيز وملفات مشابهة لتحسين تجربة الاستخدام، مثل:

# privacypolicy35
source: Remember user preferences and settings.
ar: تذكر تفضيلاتكم السابقة.

# privacypolicy36
source: Analyze usage patterns and improve service quality.
ar: تحليل أنماط الاستخدام والإحصائيات.

# privacypolicy37
source: Provide relevant offers and promotions.
ar: تقديم عروضًا وترويجات ذات صلة.

# privacypolicy38
source: You may adjust your device settings to refuse or limit cookies.
ar: يمكنكم التحكم في إعدادات الكوكيز من خلال إعدادات جهازكم.

# privacypolicy39
source: 7. User Rights
ar: 7. حقوق المستخدمين

# privacypolicy40
source: In line with the Egyptian Consumer Protection Law and applicable regulations, you have the right to:
ar: بموجب القوانين المصرية (وخاصة قانون حماية المستهلك):

# privacypolicy41
source: Request access to your personal data.
ar: لكم الحق في الوصول إلى بياناتكم الشخصية وطلب نسخة منها.

# privacypolicy42
source: Request corrections of inaccurate or incomplete data.
ar: لكم الحق في طلب تصحيح أي بيانات غير دقيقة.

# privacypolicy43
source: Request deletion of your data, except where retention is required by law.
ar: لكم الحق في طلب حذف بياناتكم، إلا في الحالات التي يتطلب فيها القانون الاحتفاظ بها.

# privacypolicy44
source: Opt-out of marketing communications at any time.
ar: يمكنكم إلغاء الاشتراك في الرسائل التسويقية في أي وقت.

# privacypolicy45
source: 8. Data Retention
ar: 8. الاحتفاظ بالبيانات

# privacypolicy46
source: We retain your personal information as long as your account is active or as necessary to provide services.
ar: نحتفظ بمعلوماتكم الشخصية طالما أن حسابكم نشط أو طالما كان ذلك ضروريًا لتقديم الخدمة.

# privacypolicy47
source: Some data may be retained longer to comply with legal obligations, resolve disputes, or enforce agreements.
ar: قد نحتفظ ببعض البيانات لفترة أطول للامتثال للالتزامات القانونية أو لحل النزاعات.

# privacypolicy48
source: 9. Third-Party Links
ar: 9. الروابط الخارجية

# privacypolicy49
source: The App may contain links to third-party websites or applications. TripTo is not responsible for the privacy practices or content of those external services.
ar: قد يحتوي التطبيق على روابط لمواقع أو تطبيقات أخرى لا نتحكم بها. نحن غير مسؤولين عن سياسات الخصوصية أو محتوى هذه المواقع.

# privacypolicy50
source: 10. Changes to this Privacy Policy
ar: 10. تغييرات سياسة الخصوصية

# privacypolicy51
source: We may update this Privacy Policy periodically. If significant changes are made, we will notify you via email or within the application.
ar: قد نقوم بتحديث هذه السياسة من وقت لآخر. سيتم إشعاركم عبر التطبيق أو البريد الإلكتروني بأي تغييرات جوهرية.

# privacypolicy52
source: 11. Contact Us
ar: 11. التواصل معنا

# privacypolicy53
source: For questions, complaints, or to exercise your rights, please contact us at:
ar: للاستفسارات أو ممارسة حقوقكم المتعلقة بالبيانات، يمكنكم التواصل عبر:

# privacypolicy54
source: Email: [Support Email]
ar: البريد الإلكتروني: [Support Email]

# privacypolicy55
source: Phone: [Support Phone Number]
ar: الهاتف: [Support Phone Number]

source: Single
ar: فردي

source: Double
ar: ثنائي

source: Triple
ar: ثلاثي

source: Quad
ar: رباعي

source: Unknown
ar: غير معروف
