Repository: kareeeeeeem/tripto
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Hello
ar: مرحبًا

# welcome
source: Welcome to my app
ar: أهلاً بيك في تطبيقي

source: Login
ar: تسجيل دخول

source: Sign Up
ar: إنشاء حساب

source: Or
ar: أو

source: Next
ar: التالي

source: Join us via phone number
ar: الدخول عبر الجوال

# wewilltextacodetoverfiyyournumber
source: We will text a code to verify your number
ar: راح نرسل لك رمز تحقق على رقم جوالك

source: Enter the code
ar: أدخل الرمز

source: We sent you a code
ar: رسلنا لك رمز

source: We sent it to
ar: رسلناه إلي

# request_code_again_timer
source: You can request code again in {time} s
ar: تقدر تطلب الرمز بعد {time} ثانية

# request_code_again
source: You can request the code again
ar: تقدر تطلب الرمز مرة ثانية

source: Confirm
ar: تأكيد

source: Resend code
ar: إعاده إرسال الرمز

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Location
ar: الموقع

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثي

source: Select a Hotel
ar: إختر الفندق

source: Select Activity
ar: إختر الوجهة

source: Finish
ar: إنتهاء

source: Tourism Company
ar: شركة السياحة

source: Flying Company
ar: شركة الطيران

source: Reserve a Car
ar: السيارة

source: Booking Hotel
ar: الفندق

source: Price
ar: السعر

source: Gold
ar: ذهبي

source: Diamond
ar: ألماسي

source: Platinum
ar: بلاتيني

source: Book Now
ar: احجز الآن

source: Category
ar: الفئة

source: Date
ar: التاريخ

source: Hotel
ar: الفندق

source: Car
ar: السيارة

source: Activities
ar: الأنشطة

source: Save
ar: حفظ

source: Info
ar: معلومات

source: Book
ar: احجز

source: Saved
ar: حفظ

source: History
ar: السجل

source: Unsave
ar: إلغاء الحفظ

source: Rebook
ar: احجز مرة أخرى

source: More
ar: المزيد

source: Less
ar: أقل

source: Destination
ar: الوجهة

source: Number of People
ar: عدد الأشخاص

source: Payment
ar: الدفع

source: Card Number
ar: رقم الكارت

source: Expiry
ar: تاريخ الإنتهاء

source: CVV
ar: رمز التحقق (CVV)

source: Pay
ar: ادفع

source: Checkout
ar: إتمام الشراء

source: Number
ar: العدد

# duration
source: For
ar: لمدة

source: min
ar: دقيقة

source: Select a Car
ar: اختر السيارة

source: Profile
ar: الملف الشخصي

source: Phone
ar: الهاتف

source: Edit
ar: تعديل

source: Please select an activity first to Finish
ar: برجاء اختيار النشاط للإنتهاء

source: Custom Trip
ar: رحلة علي كيفك

# customTripMessage
source: Hello, I would like to inquire about a custom trip.
ar: مرحبا، أريد الأستفسار عن رحلة مخصصة

# cannotOpenWhatsapp
source: Cannot open WhatsApp on this device
ar: لا يمكن فتح واتساب على هذا الجهاز

source: Color
ar: اللون

source: Year
ar: السنة

source: Please enter your name
ar: الرجاء إدخال اسمك

source: Please enter your phone number
ar: الرجاء إدخال رقم هاتفك

# phoneNumberTooShort
source: Phone number is too short
ar: رقم الهاتف قصير جداً

source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

source: Please enter your password
ar: الرجاء إدخال كلمة المرور الخاصة بك

# passwordTooShort
source: Password is too short (min 6 characters)
ar: كلمة المرور قصيرة جدًا (الحد الأدنى 6 أحرف)

source: Please confirm your password
ar: الرجاء تأكيد كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# atLeast8Chars
source: At least 8 characters
ar: 8 أحرف على الأقل

# atLeastOneLowercase
source: At least one lowercase letter
ar: حرف صغير واحد على الأقل

# atLeastOneUppercase
source: At least one uppercase letter
ar: حرف كبير واحد على الأقل

source: At least one digit
ar: رقم واحد على الأقل

# passwordNotStrongEnough
source: Password is not strong enough. Please meet all requirements.
ar: كلمة المرور ليست قوية بما فيه الكفاية. يرجى استيفاء جميع المتطلبات.

# registrationSuccess
source: Registration successful!
ar: تم التسجيل بنجاح!

# registrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.

# unexpectedError
source: An unexpected error occurred. Please try again later.
ar: حدث خطأ غير متوقع. يرجى المحاولة لاحقاً.

source: Loading...
ar: جارٍ التحميل...

# failedToSend
source: Failed to send request.
ar: فشل إرسال الطلب.

source: Fly
ar: طيران

source: Confirm Password
ar: تأكيد كلمة المرور

# pleaseEnterName
source: Please enter your name
ar: من فضلك أدخل اسمك

# pleaseEnterPhone
source: Please enter your phone number
ar: من فضلك أدخل رقم هاتفك

# phoneTooShort
source: Phone number is too short
ar: رقم الهاتف قصير جدًا

# pleaseEnterEmail
source: Please enter your email
ar: من فضلك أدخل بريدك الإلكتروني

# invalidEmail
source: Please enter a valid email
ar: البريد الإلكتروني غير صحيح

# pleaseEnterPassword
source: Please enter your password
ar: من فضلك أدخل كلمة المرور

# pleaseConfirmPassword
source: Please confirm your password
ar: من فضلك أكد كلمة المرور

source: Sign Up
ar: تسجيل

# success
source: Successful ✅
ar: تم بنجاح ✅

source: OK
ar: موافق

source: Error!
ar: خطأ

# passwordNotStrong
source: Password is not strong enough
ar: كلمة المرور غير قوية بما يكفي

# atLeast6Chars
source: At least 6 characters
ar: 6 أحرف على الأقل

source: At least one lowercase letter
ar: حرف صغير واحد على الأقل

source: At least one uppercase letter
ar: حرف كبير واحد على الأقل

source: At least one special character
ar: حرف خاص واحد على الأقل

# pleaseEnterPhoneAndPassword
source: Please enter phone number and password
ar: من فضلك أدخل رقم الهاتف وكلمة المرور

# choose_from_to
source: Choose from {from} to {to}
ar: اختر من {from} إلى {to}

# the_period_is
source: The period is: {start} to {end}
ar: الفترة: من {start} إلى {end}

source: Cancel
ar: إلغاء

source: Total price for stay
ar: إجمالي سعر الإقامة

# continueButton
source: Continue
ar: متابعة

source: Cancel Hotel
ar: إلغاء الفندق

source: Cancel Activity
ar: إلغاء النشاط

source: Cancel car
ar: إلغاء السيارة

# noDescription
source: No description available
ar: لا يوجد وصف متاح

source: WiFi
ar: واي فاي

source: Parking
ar: موقف سيارات

source: Pool
ar: مسبح

source: Gym
ar: صالة ألعاب رياضية

source: Spa
ar: سبا

source: Restaurant
ar: مطعم

source: Room Service
ar: خدمة الغرف

source: Pet Friendly
ar: مسموح باصطحاب الحيوانات

source: Room Type
ar: نوع الغرفة

source: Services
ar: الخدمات :

source: For Night:
ar: الليله:

# pricePerNight
source: ${price}/night
ar: ${price}/لليلة

# totalTrip
source: Total Trip ({nights} nights): ${totalPrice}
ar: إجمالي الرحلة ({nights} ليالي): ${totalPrice}

# tripAvailableFrom
source: Trip available from {date}
ar: الرحلة متاحة من {date}

# tripAvailableTo
source: To {date}
ar: إلى {date}

# youChoseFrom
source: You chose from: {date}
ar: لقد اخترت من: {date}

# youChoseTo
source: To: {date}
ar: إلى: {date}

# userUpdated
source: User updated successfully
ar: تم تحديث المستخدم بنجاح

source: About-Us
ar: عنَّا

# aboutus1
source: We are a passionate mobile application development agency, specializing in tourism. With
ar: نحن وكالة لتطوير تطبيقات الهواتف المحمولة، شغوفون بالسياحة. بفضل

# aboutus2
source: 20 years of experience
ar: 20 عامًا من الخبرة

# aboutus3
source: in France and Egypt, our company is
ar: في فرنسا ومصر، تُدار شركتنا

# aboutus4
source: managed from Belgium.
ar: من بلجيكا.

# aboutus5
source: We have designed a unique application to transform the planning and execution of your travels. We work with trusted partners in Egypt and the Gulf countries to guarantee a high-quality service.
ar: قمنا بتصميم تطبيق فريد لتحويل تخطيط وتنفيذ رحلاتكم. نحن نعمل مع شركاء موثوق بهم في مصر ودول الخليج لضمان تقديم خدمة عالية الجودة لكم.

# abutus6
source: Our app was created to offer a seamless and memorable travel experience. It provides you with a
ar: تم تصميم تطبيقنا لتقديم تجربة سفر سلسة لا تُنسى. فهو يقدّم لكم

# aboutus7
source: carefully selected range of the best hotels, apartments, cars, and airlines.
ar: مجموعة مختارة بعناية من أفضل الفنادق والشقق والسيارات وشركات الطيران

# aboutus8
source: We offer:
ar: نقدم لكم:

# aboutus9
source: • Flights and accommodations
ar: • رحلات طيران وإقامات.

# aboutus10
source: • Car rentals and on-site activities
ar: • تأجير سيارات وأنشطة ميدانية.

# aboutus11
source: • High-level support,
ar: • مرافقة ودعم على أعلى مستوى

# aboutus12
source: staff, to ensure a smooth journey at every step of your trip.
ar: ، مع فريق عمل مؤهل، لضمان سير كل مرحلة من مراحل إقامتكم بسلاسة

# aboutus13
source: We are committed to providing you with the best of Egypt. With our expertise and local partners, you are guaranteed an unforgettable adventure, with complete peace of mind.
ar: نحن ملتزمون بأن نقدم لكم أفضل ما في مصر. بفضل خبرتنا وشركائنا المحليين، أنتم على يقين بأنكم ستعيشون مغامرة لا تُنسى، بكل راحة بال وطمأنينة.

# aboutus14
source: TripTo simplifies your travels and guarantees 24/7 assistance in Arabic and English
ar: رحلاتك وتضمن لك المساعدة على مدار الساعة طوال أيام الأسبوع باللغتين العربية والإنجليزية

source: Favourite
ar: المفضلة

source: Side Menu
ar: قائمة الصفحات

# cancellation1
source: Cancellation and Refund Policy
ar: سياسة الإلغاء واسترداد الأموال

# cancellation2
source: 1. Introduction and Scope of Policy
ar: 1. مقدمة ونطاق السياسة

# cancellation3
source: Welcome to [TripTo]. We strive to provide a transparent and fair booking experience. This policy 'the Policy' explains the terms and conditions related to cancellations and refunds for services booked through our application, which include but are not limited to: flight bookings, hotel accommodations, holiday packages, tours, and recreational activities 'the Services'.
ar: أهلاً بك في [ترب تو]. نحن نسعى لتقديم تجربة حجز شفافة وعادلة. توضح هذه السياسة 'السياسة' الشروط والأحكام المتعلقة بعمليات الإلغاء واسترداد المبالغ المدفوعة للخدمات المحجوزة عبر تطبيقنا، والتي تشمل على سبيل المثال لا الحصر: حجوزات الطيران، الإقامات الفندقية، باقات العطلات، الجولات السياحية، والأنشطة الترفيهية

# cancellation4
source: Completing a booking through [Tripto] signifies your agreement to this Policy and to the terms and conditions of the end-service provider (e.g., the airline, hotel, or tour operator).
ar: إن إتمام الحجز عبر [ ترب تو] يعني موافقتك على هذه السياسة وعلى شروط وأحكام مزود الخدمة النهائي (مثل شركة الطيران، الفندق، منظم الرحلات).

# cancellation5
source: 2. Cancellation and Refund Policy
ar: 2. سياسة الإلغاء والاسترداد

# cancellation6
source: The cancellation and refund policy is primarily subject to the terms set by the end-service provider. [TripTo] acts as an intermediary, and we will clearly display the specific cancellation terms for each booking during the reservation process and before you complete the payment.
ar: تخضع سياسة الإلغاء والاسترداد بشكل أساسي للشروط التي يضعها مزود الخدمة النهائي. يعمل [ترب تو] كوسيط، وسنقوم بعرض شروط الإلغاء الخاصة بكل حجز بوضوح تام أثناء عملية الحجز وقبل إتمام عملية الدفع.

# cancellation7
source: 2.1. Flight Bookings
ar: 2.1. حجوزات الطيران

# cancellation8
source: • Non-refundable Tickets:
ar: • تذاكر غير قابلة للاسترداد:

# cancellation9
source: Most airline tickets, especially promotional and economy fares, are non-refundable. If the traveler cancels the booking, no part of the payment may be refunded.
ar: معظم تذاكر الطيران، خاصة التذاكر الترويجية والاقتصادية، تكون غير قابلة للاسترداد. في حال إلغاء الحجز من قبل المسافر، قد لا يتم استرداد أي جزء من المبلغ.

# cancellation10
source: • Refundable Tickets:
ar: • تذاكر قابلة للاسترداد:

# cancellation11
source: Some ticket categories may allow for refunds, but a 'cancellation fee' set by the airline will often be applied. The refunded amount will be the total amount paid minus this fee.
ar: بعض فئات التذاكر تسمح بالاسترداد، ولكن غالبًا ما يتم تطبيق 'رسوم إلغاء' تحددها شركة الطيران. المبلغ المسترد سيكون هو المبلغ الإجمالي مخصومًا منه هذه الرسوم.

# cancellation12
source: • Cancellation by the Airline:
ar: • إلغاء من قبل شركة الطيران

# cancellation13
source: If a flight is canceled by the airline, the customer is entitled to a full refund or an alternative booking, in accordance with the airline's policy and the governing Egyptian law.
ar: : في حال تم إلغاء الرحلة من قبل شركة الطيران، يحق للعميل استرداد كامل المبلغ المدفوع أو الحصول على حجز بديل وفقًا لسياسة شركة الطيران والقانون المصري المنظم.

# cancellation14
source: • Modifications:
ar: • التعديلات:

# cancellation15
source: Any changes to a booking (such as date changes) are subject to fees determined by the airline in addition to any price difference.
ar: أي تعديل على الحجز (مثل تغيير التواريخ) يخضع لرسوم تحددها شركة الطيران بالإضافة إلى أي فارق في السعر.

# cancellation16
source: 2.2. Hotel and Accommodation Bookings
ar: 2.2. حجوزات الفنادق وأماكن الإقامة

# cancellation17
source: • Each hotel has its own cancellation policy, which will be clearly displayed during the booking process.
ar: • لكل فندق سياسة إلغاء خاصة به. سيتم عرض هذه السياسة بوضوح أثناء الحجز.

# cancellation18
source: • Free Cancellation:
ar: • الإلغاء المجاني:

# cancellation19
source: Many hotels offer a free cancellation period (for example, up to 48 hours before the check-in date). If the cancellation is made within this period, the customer is entitled to a full refund
ar: توفر العديد من الفنادق فترة إلغاء مجانية (على سبيل المثال، حتى 48 ساعة قبل تاريخ تسجيل الوصول). إذا تم الإلغاء خلال هذه الفترة، يحق للعميل استرداد المبلغ المدفوع بالكامل.

# cancellation20
source: • Cancellation Fees:
ar: • رسوم الإلغاء:

# cancellation21
source: After the free cancellation period expires, the hotel may impose a cancellation fee, which could be equivalent to the cost of the first night or the entire booking value
ar: : بعد انتهاء فترة الإلغاء المجاني، قد يفرض الفندق رسوم إلغاء، والتي قد تصل إلى تكلفة الليلة الأولى أو كامل قيمة الحجز.

# cancellation22
source: • No-Show:
ar: • عدم الحضور:

# cancellation23
source: Any changes to a booking (such as date changes) are subject to fees determined by the airline in addition to any price difference.
ar: في حالة عدم تسجيل الوصول في الفندق في الموعد المحدد دون إلغاء مسبق، يعتبر الحجز 'عدم حضور'، وفي معظم الحالات لا يحق للعميل استرداد أي مبلغ.

# cancellation24
source: 2.3. Holiday Packages, Tours, and Activities
ar: 2.3. الباقات السياحية، الجولات والأنشطة

# cancellation25
source: • Packages and tours are subject to the specific cancellation policy of the tour operator.
ar: • تخضع الباقات والجولات لسياسة إلغاء خاصة بمُنظم الرحلة.

# cancellation26
source: • Cancellation fees are often tiered; the closer the cancellation date is to the start date of the trip, the higher the fee. For example:
ar: • غالبًا ما تكون رسوم الإلغاء متدرجة؛ فكلما اقترب موعد الإلغاء من تاريخ بدء الرحلة، زادت قيمة الرسوم المخصومة. على سبيل المثال:

# cancellation27
source: o Cancellation more than 30 days prior: 25% deduction from the package price.
ar: o الإلغاء قبل 30 يومًا: خصم 25% من قيمة الباقة.

# cancellation28
source: o Cancellation between 15 and 29 days prior: 50% deduction from the package price.
ar: o الإلغاء بين 15 و 29 يومًا: خصم 50% من قيمة الباقة.

# cancellation29
source: o Cancellation less than 15 days prior: 100% deduction from the package price.
ar: o الإلغاء قبل أقل من 15 يومًا: خصم 100% من قيمة الباقة.

# cancellation30
source: o The specific cancellation fee schedule for each package will be clarified before the booking is confirmed.
ar: o سيتم توضيح جدول رسوم الإلغاء الخاص بكل باقة قبل تأكيد الحجز.

# cancellation31
source: 3. Cancellation Request Procedure
ar: 3. إجراءات طلب الإلغاء

# cancellation32
source: • All cancellation requests must be submitted through your personal account in the [Trip To] application.
ar: • يجب تقديم جميع طلبات الإلغاء من خلال حسابك الشخصي في تطبيق [ترب تو].

# cancellation33
source: • You can find the cancellation option within the booking details under the 'My Bookings' section.
ar: • يمكنك العثور على خيار الإلغاء داخل تفاصيل الحجز في قسم 'حجوزاتي'.

# cancellation34
source: • The date and time we receive the cancellation request will be the basis for applying the cancellation terms.
ar: • يعتبر تاريخ ووقت استلامنا لطلب الإلغاء هو الأساس الذي سيتم بناءً عليه تطبيق شروط الإلغاء.

# cancellation35
source: • For assistance, you can contact our customer service team via [Support Email] or [Support Phone Number].
ar: • للمساعدة، يمكنك التواصل مع فريق خدمة العملاء لدينا عبر [البريد الإلكتروني للدعم] أو [رقم هاتف الدعم].

# cancellation36
source: 4. Refund Processing
ar: 4. معالجة المبالغ المستردة

# cancellation37
source: • Once the refund request is approved by the service provider, we will process the amount.
ar: • بمجرد الموافقة على طلب الاسترداد من قبل مزود الخدمة، سنقوم بمعالجة المبلغ.

# cancellation38
source: • Refunds will be issued to the
ar: • يتم رد المبالغ المستحقة إلى

# cancellation39
source: original payment method
ar: وسيلة الدفع الأصلية

# cancellation40
source: used for the booking.
ar: التي تم استخدامها عند الحجز.

# cancellation41
source: • The refund process may take from
ar: • قد تستغرق عملية الاسترداد فترة تتراوح بين

# cancellation42
source: 7 to 21 business days
ar: 7 إلى 21 يوم عمل

# cancellation43
source: to appear in your bank account or on your credit card statement, depending on the policies of the respective bank
ar: لتظهر في حسابك البنكي أو بطاقتك الائتمانية، وذلك حسب سياسات البنك المعني.

# cancellation44
source: • The service/booking fees for the [Trip] application (if any) are administrative fees and are non-refundable, except in cases of cancellation by the service provider.
ar: • رسوم الخدمة/الحجز الخاصة بتطبيق [ترب تو] (إن وجدت) هي رسوم إدارية غير قابلة للاسترداد إلا في حالة الإلغاء من جانب مزود الخدمة.

# cancellation45
source: 5. Force Majeure
ar: 5. الظروف القاهرة

# cancellation46
source: In cases of force majeure events beyond the control of any party (such as natural disasters, pandemics, wars, sudden government decisions) that prevent the service from being rendered, we will adhere to the policies set by the end-service providers and Egyptian law. We will do our utmost to assist our customers in finding the best possible solutions, which may include refunds or vouchers for future use.
ar: في حالات الظروف القاهرة التي تخرج عن إرادة جميع الأطراف (مثل الكوارث الطبيعية، الأوبئة، الحروب، القرارات الحكومية المفاجئة)، والتي تحول دون تنفيذ الخدمة، سنلتزم بالسياسات التي يقرها مزودو الخدمة النهائيون والقانون المصري. وسنبذل قصارى جهدنا لمساعدة عملائنا في إيجاد أفضل الحلول الممكنة، والتي قد تشمل استرداد المبالغ أو تقديم قسائم للاستخدام المستقبلي.

# cancellation47
source: 6. Governing Law
ar: 6. القانون الحاكم

# cancellation48
source: This Policy shall be governed and construed in accordance with the laws of the Arab Republic of Egypt, particularly the Consumer Protection Law. In the event of any dispute, the competent Egyptian courts shall have exclusive jurisdiction.
ar: تخضع هذه السياسة وتُفسّر وفقًا لأحكام قوانين جمهورية مصر العربية، وعلى وجه الخصوص قانون حماية المستهلك. في حالة نشوء أي نزاع، تكون المحاكم المصرية المختصة هي صاحبة الولاية القضائية الحصرية.

source: Logout
ar: تسجيل الخروج

# deletmyaccount
source: Delete my account
ar: حذف حسابي

source: Privacy policy
ar: سياسة الخصوصية

# privacypolicy1
source: Privacy policy for [Trip To]
ar: سياسة الخصوصية

# introduction
source: 1. Introduction
ar: 1. المقدمة.

# privacypolicy2
source: At [TripTo], we are committed to protecting the privacy of our users. This Privacy Policy explains how we collect, use, share, and safeguard your personal information when you use our application and related services.
ar: نحن في [ترب تو ] نولي أهمية قصوى لحماية خصوصية مستخدمينا. تهدف هذه السياسة إلى توضيح كيفية جمعنا واستخدامنا وحمايتنا لمعلوماتكم الشخصية عند استخدامكم للتطبيق وخدماته.

# privacypolicy3
source: By accessing or using the TripTo application, you consent to the practices described in this Privacy Policy.
ar: باستخدامكم للتطبيق، فإنكم توافقون على أحكام هذه السياسة.

# privacypolicy4
source: 2. Information We Collect
ar: 2. المعلومات التي نقوم بجمعها

# privacypolicy5
source: Information You Provide Directly:
ar: المعلومات الشخصية التي تقدمونها بأنفسكم:

# privacypolicy6
source: Payment details (credit/debit cards, e-wallets)
ar: بيانات الدفع (بطاقات الائتمان، المحافظ الإلكترونية)

# privacypolicy7
source: Phone number
ar: رقم الهاتف

# privacypolicy8
source: Passport or ID information when required for travel bookings
ar: بيانات جواز السفر أو الهوية عند الحاجة لحجوزات السفر

# privacypolicy9
source: Information Collected Automatically:
ar: المعلومات التي يتم جمعها تلقائيًا:

# privacypolicy10
source: Device information (model, operating system, unique identifiers)
ar: بيانات الجهاز (نوع الهاتف، نظام التشغيل، معرفات فريدة)

# privacypolicy11
source: IP address
ar: عنوان بروتوكول الإنترنت (IP Address)

# privacypolicy12
source: Location data (if permitted by the user)
ar: بيانات الموقع الجغرافي (في حال السماح بذلك)

# privacypolicy13
source: Usage data (search history, booking history, interactions within the App)
ar: سجل الاستخدام (التصفّح داخل التطبيق، عمليات البحث، الحجوزات السابقة)

# privacypolicy14
source: 3. How We Use Your Information
ar: 3. كيفية استخدام المعلومات

# privacypolicy15
source: We use the information we collect for purposes including, but not limited to:
ar: نستخدم البيانات التي نجمعها للأغراض التالية:

# privacypolicy16
source: Processing bookings and payments.
ar: معالجة الحجوزات والدفع.

# privacypolicy17
source: Sending booking confirmations and important notifications.
ar: إرسال تأكيدات الحجز والإشعارات المهمة.

# privacypolicy18
source: Providing customer support and technical assistance.
ar: تقديم خدمة عملاء ودعم فني أفضل.

# privacypolicy19
source: Improving and personalizing the user experience.
ar: تحسين تجربة الاستخدام وتطوير خدماتنا.

# privacypolicy20
source: Sending promotional offers or marketing communications (with your consent).
ar: إرسال العروض الترويجية أو الإشعارات التسويقية (في حال منحتم الموافقة).

# privacypolicy21
source: Complying with applicable legal and regulatory requirements.
ar: الامتثال للقوانين واللوائح المصرية والدولية ذات الصلة.

# privacypolicy22
source: 4. Sharing of Information
ar: 4. مشاركة المعلومات

# privacypolicy23
source: We may share your data in the following circumstances:
ar: قد تتم مشاركة بياناتكم في الحالات التالية فقط:

# privacypolicy24
source: With service providers (e.g., airlines, hotels, tour operators) to complete your booking.
ar: مع مزودي الخدمة (مثل شركات الطيران، الفنادق، منظمي الرحلات) لتنفيذ الحجز.

# privacypolicy25
source: With payment processors to facilitate secure transactions.
ar: مع مزودي خدمات الدفع لمعالجة المعاملات المالية.

# privacypolicy26
source: With legal or regulatory authorities if required by law.
ar: مع الجهات القانونية أو الحكومية إذا طُلب منا ذلك بموجب القانون.

# privacypolicy27
source: With business partners in joint marketing campaigns (only with your prior consent).
ar: مع شركائنا التجاريين في حال الحملات التسويقية (بعد موافقتكم).

# privacypolicy28
source: We do not sell or rent your personal information to third parties.
ar: ترب تو لا يبيع أو يؤجر بياناتكم الشخصية لأي طرف ثالث.

# privacypolicy29
source: 5. Data Security
ar: 5. أمن وحماية البيانات

# privacypolicy30
source: We implement industry-standard security measures, including encryption, to protect your data.
ar: نستخدم بروتوكولات أمان وتشفير متقدمة لحماية بياناتكم.

# privacypolicy31
source: Access to personal information is restricted to authorized employees only.
ar: نحد من الوصول إلى المعلومات الشخصية بحيث يقتصر على الموظفين المصرح لهم فقط.

# privacypolicy32
source: However, no method of transmission over the internet is 100% secure, and we cannot guarantee absolute protection.
ar: رغم ذلك، لا يمكن ضمان أمان تام بنسبة 100% عبر الإنترنت، وعليه فإن استخدامكم للتطبيق يقع على مسؤوليتكم.

# privacypolicy33
source: 6. Cookies and Tracking Technologies
ar: 6. ملفات تعريف الارتباط (Cookies)
